tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.ustc.edu.cn/homebrew-cask.git"
tap "homebrew/cask-fonts"
tap "homebrew/core", "https://mirrors.ustc.edu.cn/homebrew-core.git"
cask "xquartz"
# Fast, simple and clean video downloader
brew "annie"
# Graphical system information display for macOS
brew "archey"
# Interpreted, interactive, object-oriented programming language
brew "python", link: false
# Record and share terminal sessions
brew "asciinema"
# Shell extension to jump to frequently used directories
brew "autojump"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Music player with an ncurses based interface
brew "cmus"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# Apache HTTP server
brew "httpd"
# Add GitHub support to git on the command-line
brew "hub"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern and intuitive terminal-based text editor
brew "micro"
# Terminal-based music player
brew "moc"
# MP3 player for Linux and UNIX
brew "mpg123"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Hook preloader
brew "proxychains-ng"
# Cross-platform application and UI framework
brew "qt"
# Python bindings for v5 of Qt
brew "pyqt"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Aspect-oriented approach to writing compilers
brew "treecc"
# Converts a ttyrec file into gif files
brew "ttygif"
# Ogg Vorbis CODEC tools
brew "vorbis-tools"
# Internet file retriever
brew "wget"
# Download and install various runtime libraries
brew "winetricks"
# Dumb downloader that scrapes the web
brew "you-get"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
cask "devdocs"
cask "hyper"
cask "ieasemusic"
cask "iina"
cask "keep-it"
cask "mpv"
cask "pycharm"
cask "soundflower"
cask "soundnode"
cask "sublime-text"
cask "teamviewer"
cask "telegram-desktop"
cask "webstorm"
cask "wewechat"
